# Требования к коду.
## Оформление кода, линтеры, форматеры

### Задание

Стас Басов получил задание написать программу, которая складывает два числа, передаваемых в качестве аргументов функции. Однако он забыл про стандарты PEP 8 и про код-стайл.

Стас написал код:

```PYTHON
import sys;
def add(x,y):
    return x+y;
x = 10
y = 5;
print("Сумма чисел: ",add(x,y))
```

Исправьте все проблемы форматированием и стилем, следуя рекомендациям.


```PYTHON
# stas_basov.py
def add(x, y):
    return x+y


x = 10
y = 5
print("Сумма числе: ", add(x, y))
```

## Аннотация типов

В простейшем случае аннотация описывает непосредственно ожидаемый тип данных, например str, int, float или bool. Можно применять и None, "Ничего". Например, если функция ничего не возвращает, тип возращаемых данных указыватеся как None.

Переменные в Python обычно аннотируются так:

```PYTHON
#type.annotation.py
var_integer: int = 10

var_float: float = 3.5

var_flag: bool = True

var_string: str = "String"

```

Для функций тоже можно указывать аннотации, например для аргументов и возвращаемого значения.
