# Урок 3. Конструктор класса - метод init().
## Практическая работа

Помимо конструктора объектов в языках программирования есть обратный ему метод – деструктор. Он вызывается, когда объект не создается, а уничтожается.  

В языке программирования Python объект уничтожается, когда исчезают все связанные с ним переменные или им присваивается другое значение, в результате чего связь со старым объектом теряется. Удалить переменную можно с помощью команды языка `del`.  

В классах Python функцию деструктора выполняет метод `__del__()`.  

Напишите программу по следующему описанию:  

1. Есть класс `Person`, конструктор которого принимает три параметра (не учитывая `self`) – имя, фамилию и квалификацию специалиста. Квалификация имеет значение, заданное по умолчанию, равное единице.  

2. У класса `Person` есть метод, который возвращает строку, включающую в себя всю информацию о сотруднике.  

3. Класс `Person` содержит деструктор, который выводит на экран фразу `"До свидания, мистер ..."` (вместо троеточия должны выводиться имя и фамилия объекта).  

4. В основной ветке программы создайте три объекта класса `Person`. Посмотрите информацию о сотрудниках и увольте самое слабое звено.  

5. В конце программы добавьте функцию `input()`, чтобы скрипт не завершился сам, пока не будет нажат Enter. Иначе вы сразу увидите, как удаляются все объекты при завершении работы программы.
```PYTHON
from random import randint

class Person:
    def __init__(self, name, second_name, qualification=1):
        self.name = name
        self.second_name = second_name
        self.qualification = qualification

    def info(self):
        print(f"Имя: {self.name}, Фамилия: {self.second_name}, "
              f"Квалификация:{self.qualification}")

    def __del__(self):
        print(f"До свидания мистер {self.name} {self.second_name}")


first_person = Person("Ivan", "Ivanov", 3)
second_person = Person("Petr", "Petrov", 2)
third_person = Person("Oleg", "Olegov")

first_person.info()
second_person.info()
third_person.info()
del third_person
input()
```